# vsoDisableAttrs

```pascal
PROCEDURE vsoDisableAttrs(attrsBits : LONGINT);
```

```python
def vs.vsoDisableAttrs(attrsBits):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|attrsBits|LONGINT|   |

## Examples
```pascal
vsoDisableAttrs(1);
```
```python
import vs

attrsBits = 1

vs.vsoDisableAttrs(attrsBits)
```

## Version
Availability: from Vectorworks 2020

## Category
* Object Events